
# Задайте список из n чисел последовательности (1 + 1/n)**n и выведите на экран их сумму.

# *Пример:*

# - Для n = 6:
#     [2.0, 2.25, 2.3704, 2.4414, 2.4883, 2.5216]
#     Сумма чисел = 14.0717

N = int(input('Введите число N: '))
func = lambda x: float((1 + 1/x)**x)
result = [func(i) for i in range(1,N+1)] 
sum=0
for elem in result:
    sum += elem
print('сумма чисел', sum)